# Multi-table SQL
## Tracks DB

In [1]:
import sqlite3

conn = sqlite3.connect('tracks.sqlite')
cur = conn.cursor()

cur.execute('DROP TABLE IF EXISTS Artist')
cur.execute('DROP TABLE IF EXISTS Album')
cur.execute('DROP TABLE IF EXISTS Genre')
cur.execute('DROP TABLE IF EXISTS Track')

cur.execute('''CREATE TABLE Artist (
    id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL UNIQUE, 
    name TEXT)''')

cur.execute('''CREATE TABLE Album (
    id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL UNIQUE,
    title TEXT,
    artist_id INTEGER,
    FOREIGN KEY(artist_id) REFERENCES Artist(id))''')

cur.execute('''CREATE TABLE Genre (
    id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL UNIQUE,
    name TEXT)''')

cur.execute('''CREATE TABLE Track (
    id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL UNIQUE,
    title TEXT,
    rating INTEGER,
    len INTEGER,
    count INTEGER,
    album_id INTEGER,
    genre_id INTEGER,
    FOREIGN KEY(album_id) REFERENCES Album(id),
    FOREIGN KEY(genre_id) REFERENCES Genre(id))''')

In [2]:
cur.execute('''INSERT INTO Artist (name) VALUES ('Led Zepplin')''')
cur.execute('''INSERT INTO Artist (name) VALUES ('AC/DC')''')

cur.execute('''INSERT INTO Genre (name) VALUES ('Rock')''')
cur.execute('''INSERT INTO Genre (name) VALUES ('Metal')''')

cur.execute('''INSERT INTO Album (title, artist_id) VALUES ('Who Made Who', 2)''')
cur.execute('''INSERT INTO Album (title, artist_id) VALUES ('IV', 1)''')

cur.execute('''INSERT INTO Track (title, rating, len, count, album_id, genre_id)
    VALUES ('Black Dog', 5, 297, 0, 2, 1)''')
cur.execute('''INSERT INTO Track (title, rating, len, count, album_id, genre_id)
    VALUES ('Stairway', 5, 482, 0, 2, 1)''')
cur.execute('''INSERT INTO Track (title, rating, len, count, album_id, genre_id)
    VALUES ('About to Rock', 5, 313, 0, 1, 2)''')
cur.execute('''INSERT INTO Track (title, rating, len, count, album_id, genre_id)
    VALUES ('Who Made Who', 5, 207, 0, 1, 2)''')

conn.commit()

In [4]:
result1 = cur.execute(
'''SELECT Album.title, Artist.name 
    FROM Album JOIN Artist
    ON Album.artist_id = Artist.id''')
result1

In [5]:
# cur.execute returns an iterator, but we can get all the rows at once by making it a list
# better to use a for loop!
list(result1)

[('Who Made Who', 'AC/DC'), ('IV', 'Led Zepplin')]

In [6]:
result2 = cur.execute(
'''SELECT Track.title, Artist.name, Album.title, Genre.name
    FROM Track JOIN Genre JOIN Album JOIN Artist 
    ON Track.genre_id = Genre.id AND Track.album_id = Album.id AND 
       Album.artist_id = Artist.id''')

In [7]:
list(result2)

[('Black Dog', 'Led Zepplin', 'IV', 'Rock'),
 ('Stairway', 'Led Zepplin', 'IV', 'Rock'),
 ('About to Rock', 'AC/DC', 'Who Made Who', 'Metal'),
 ('Who Made Who', 'AC/DC', 'Who Made Who', 'Metal')]

In [8]:
cur.close() # we are done sending commands to the DB for now   
conn.close() # we are completely done with the DB in this programconn.close()

# Many-to-Many Relationship

## Courses DB

In [9]:
import sqlite3

conn = sqlite3.connect('courses.sqlite')
cur = conn.cursor()

cur.execute('DROP TABLE IF EXISTS User')
cur.execute('DROP TABLE IF EXISTS Course')
cur.execute('DROP TABLE IF EXISTS Takes')

cur.execute('''CREATE TABLE User (
    id     INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
    name   TEXT UNIQUE,
    email  TEXT)''')

cur.execute('''CREATE TABLE Course (
    id     INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
    title  TEXT UNIQUE)''')

cur.execute('''CREATE TABLE Takes (
    user_id     INTEGER,
    course_id   INTEGER,
    role        INTEGER,
    PRIMARY KEY (user_id, course_id))''')

In [10]:
cur.execute('''INSERT INTO User (name, email) VALUES ('Jane', 'jane@tsugi.org')''')
cur.execute('''INSERT INTO User (name, email) VALUES ('Ed', 'ed@tsugi.org')''')
cur.execute('''INSERT INTO User (name, email) VALUES ('Sue', 'sue@tsugi.org')''')

cur.execute('''INSERT INTO Course (title) VALUES ('Python')''')
cur.execute('''INSERT INTO Course (title) VALUES ('SQL')''')
cur.execute('''INSERT INTO Course (title) VALUES ('PHP')''')

cur.execute('''INSERT INTO Takes (user_id, course_id, role) VALUES (1, 1, 1)''')
cur.execute('''INSERT INTO Takes (user_id, course_id, role) VALUES (2, 1, 0)''')
cur.execute('''INSERT INTO Takes (user_id, course_id, role) VALUES (3, 1, 0)''')

cur.execute('''INSERT INTO Takes (user_id, course_id, role) VALUES (1, 2, 0)''')
cur.execute('''INSERT INTO Takes (user_id, course_id, role) VALUES (2, 2, 1)''')

cur.execute('''INSERT INTO Takes (user_id, course_id, role) VALUES (2, 3, 1)''')
cur.execute('''INSERT INTO Takes (user_id, course_id, role) VALUES (3, 3, 0)''')

conn.commit()

In [11]:
result3 = cur.execute('''SELECT User.name, Takes.role, Course.title
  FROM User JOIN Takes JOIN Course
  ON Takes.user_id = User.id AND Takes.course_id = Course.id
  ORDER BY Course.title, Takes.role DESC, User.name''')

In [12]:
list(result3)

[('Ed', 1, 'PHP'),
 ('Sue', 0, 'PHP'),
 ('Jane', 1, 'Python'),
 ('Ed', 0, 'Python'),
 ('Sue', 0, 'Python'),
 ('Ed', 1, 'SQL'),
 ('Jane', 0, 'SQL')]

In [ ]:
cur.close() # we are done sending commands to the DB for now
conn.close() # we are completely done with the DB in this program